[
  {
    "id": 3,
    "title": "My site",
    "name": "MYSITE",
    "technologies": [
      "React",
      "Typescript",
      "styled-component",
      "Recoil",
      "usequery"
    ],
    "description": "나의 포트폴리오 사이트 만들기",
    "demo_link": "https://duckguya.github.io/mysite/#/mysite/",
    "github_link": "https://github.com/duckguya/mysite",
    "function": [
      "recoil을 이용하여 css적용하기",
      "axios로 프로젝트 데이터 호출하고 usequery 데이터 캐싱하기",
      "useNavigate와 Link로 페이지 이동하기",
      "position:sticky 적용하기"
    ],
    "contents": [
      {
        "sub_title": "Home",
        "image": "",
        "text": "주력 기술인 react와 typescript로 프로젝트 블로그를 만들 계획을 세웠습니다.\n화려한 애니메이션보단 심플하게 만들고 눈의 흐름에 맞게 폰트를 조절하여 페이지를 구성하였습니다.\n\n페이지의 위치에 따라 헤더의 탭의 색깔이 변경될 수 있도록 recoil을 사용하였습니다. 현재 페이지의 위치를 위해 react router dom의 useLoacation을 사용하였습니다.\n\n프로젝트 리스트는 썸네일을 넣어주고 마우스 오버 시 프로젝트의 간략한 설명이 올라오도록 하였습니다.\n각 페이지의 데이터는 github에 json 형식으로 파일을 생성하고 axios를 이용하여 데이터를 호출하였습니다. 호출된 데이터는 usequery로 캐싱 하여 관리하였습니다. \n\ncss 효과 중 position:sticky를 꼭 사용하고 싶었습니다. 그래서 프로젝트 디테일에 사용하였습니다. 만약 글이 길어 지루할 경우 왼쪽에 이미지가 고정되어 재미를 더해줄 효과를 기대하였습니다.\n레이아웃은 flex로 구성하였고 왼쪽엔 이미지 오른쪽에 글이 올 수 있도록 배치하였습니다. 글의 세로 길이가 이미지보다 길 경우 이미지는 고정되고 글의 스크롤이 다 올라가면 고정이 풀리는 효과를 주었습니다."
      }
    ],

    "thumbnail": ""
  },
  {
    "id": 0,
    "title": "To Do List",
    "name": "TODO",
    "technologies": [
      "React",
      "Typescript",
      "styled-component",
      "Recoil",
      "Localstorage"
    ],
    "description": "recoil을 활용한 ToDoList 구현하기",
    "demo_link": "https://duckguya.github.io/to-do-list/#/",
    "github_link": "https://github.com/duckguya/to-do-list",
    "function": [
      "Recoil을 이용한 다크 모드 구현",
      "ToDo 생성",
      "ToDo 수정",
      "ToDo 삭제",
      "recoil selector를 이용한 ToDo 카테고리 변경"
    ],
    "contents": [
      {
        "sub_title": "다크 모드",
        "image": "todo1",
        "text": "Recoil을 사용하여 atom의 값에 따라 다크 모드와 라이트 모드가 변경되도록 구현하였습니다.\natom의 기본값은 boolean 타입으로 지정해 주었습니다.\nThemeProvider를 다크 모드가 필요한 컴포넌트 위에 래핑 해주어 atom의 값이 변경되면 미리 설정해놓은 스타일 객체를 적용시켜 전역으로 theme의 스타일을 사용할 수 있게 하였습니다.\n\nuseRecoilState을 사용하여 다크 모드 버튼을 누르면 현재 값의 반대 값으로 변경시켜 값을 업데이트했습니다.\n해당 atom을 구독하고 있던 ThemeProvider에 theme의 값이 변경되어 다크 모드와 라이트 모드를 사용할 수 있게 하였습니다."
      },
      {
        "sub_title": "ToDo 생성",
        "image": "todo2",
        "text": "생성한 투두를 바로 볼 수 있게 상태 관리 라이브러리인 recoil을 사용하였습니다.\nToDo 저장 버튼 클릭 시 recoil atom의 state 값을 업데이트하기 위해 useSetRecoilState 함수를 사용하였습니다. 리턴된 setter 함수에 작성한 toDo와 카테고리 위치 그리고 id를 넣어주었습니다. id는 Date 함수로 밀리 초를 사용하여 유니크한 값을 사용할 수 있게 하였습니다.\n\n저장 및 상태 동기화를 위해 Recoil-persist 라이브러리를 사용하였습니다. localstorage에 저장하기 위해 아무런 설정을 해주지 않았습니다.\n\nuseForm hook을 사용하여 input에서 값을 불러오고 유효성 검사를 하였습니다. register 메소드를 사용하여 검증 규칙을 적용할 수 있게 하였습니다.\nuesFormState hook으로부터 받은 errors 객체를 이용해 에러가 날 경우 필요한 문구를 내보내어 사용자가 문제를 인식할 수 있게 하였습니다.\n유효성 검사를 통과하면 handleSubmit함수를 사용하여 form의 데이터를 매개변수로 전달받아 사용하였습니다."
      },
      {
        "sub_title": "ToDo 수정",
        "image": "todo3",
        "text": "컴포넌트 상태 관리를 위하여 리액트의 Hook인 useState를 사용하였습니다.\nuseState를 이용해 boolean 타입인 isEdit 변수를 만들고 값에 따라 수정 페이지가 나타나도록 하였습니다.\nuseRecoilState 함수를 사용하여 setter 함수를 받아 업데이트하였습니다.\n스프레드 연산자로 기존 데이터를 복사한 후 findIndex 함수로 수정할 id와 같은 값을 찾아 index를 반환하였습니다. splice 함수로 해당 인덱스를 삭제해주고 slice 함수로 수정할 인덱스 앞뒤에 있는 데이터를 찾아주었습니다. 해당 값들을  스프레드 연산자로 넣어주고 가운데에 새 투두 데이터를 넣어주어 수정해 주었습니다. "
      },
      {
        "sub_title": "ToDo 삭제",
        "image": "todo4",
        "text": "스프레드 연산자를 이용하여 기존에 있던 데이터를 복사해 주었습니다. 그리고 findIndex 함수를 이용해 id 값이 동일한 데이터의 인덱스 값을 반환시켜줍니다. slice 함수를 이용하여 해당 인덱스 데이터를 삭제시킵니다."
      },
      {
        "sub_title": "ToDo 카테고리 변경",
        "image": "todo5",
        "text": "recoil의 selector를 이용하여 카테고리 state가 변경되면 가져와야 할 ToDo 데이터를 변경할 수 있도록 처리하였습니다.\nrecoil atom을 이용하여 카테고리 state를 만들어주었습니다. 카테고리 변경 버튼을 누르면 useRecoilState로 카테고리 state를 변경합니다. 해당 atom이 변하면 toDoSelector가 업데이트됩니다. toDoSelector는 get을 통해 전처리한 toDoState와 categoryState를 가져옵니다. 그리고 filter 함수를 통해 같은 카테고리의 데이터를 리턴하여 재렌더링합니다. "
      }
    ],

    "thumbnail": "todo_thumbnail"
  },
  {
    "id": 1,
    "title": "Netflix clone",
    "name": "NETFLIX",
    "technologies": ["React", "Typescript", "styled-component", "react-query"],
    "description": "TMDB API를 이용하여 영화, 드라마 페이지 구현하기",
    "demo_link": "https://duckguya.github.io/netflix-clone/#/",
    "github_link": "https://github.com/duckguya/netflix-clone",
    "function": [
      "영화/드라마 리스트 페이지",
      "영화 디테일 페이지(내가 선택한 콘텐츠와 비슷한 콘텐츠 리스트, 내가 선택한 영화 예고편)",
      "검색 페이지",
      "react-loading-skeleton으로 로딩화면 구현",
      "error page"
    ],
    "contents": [
      {
        "sub_title": "Content List",
        "image": "net1",
        "text": "모든 페이지의 레이아웃 배치는 flex를 사용했습니다.\ncarousel을 구현하기 위해 react-slick 라이브러리를 사용했습니다. 기본 carousel에서 넷플릭스와 어울리도록 커스터마이징을 하였습니다.\n 영화 페이지와 티비쇼 페이지의 레이아웃이 같기 때문에 하나의 컴포넌트로 어떻게 재활용 할지 고민했습니다.\n시작부터 깔끔히 코드를 짜야 한다는 생각에 집중하다 보니 오히려 코드가 정리되지 않았습니다. 그래서 각각의 컴포넌트를 만들고 후반에 정리하는 작업을 했습니다. 각각 라우터를 만들어주고 하나의 컴포넌트에 연결해 주었습니다. props에 type을 줘서 tv, movie를 구분을 주었습니다.\n컴포넌트를 통합하고 나니 css 작업을 효율적으로 할 수 있게되었습니다. 중복되는 코드를 자동화하여 코드를 개선시켰습니다. "
      },
      {
        "sub_title": "Content Detail",
        "image": "net2",
        "text": "react-player 라이브러리를 사용하였습니다. 해당 콘텐츠에 youtube 영상이 포함되어 있으면 비디오를 key를 가져오는 api를 호출했습니다.\n오래된 영화같이 영상이 포함되어 있지 않으면 포스터를 대신 배치했습니다.\n\n비슷한 콘텐츠 api를 호출하여 하단을 채워주었습니다. 비슷한 콘텐츠는 리스트가 많기 때문에 9개로 제한하였습니다."
      },
      {
        "sub_title": "Content Search",
        "image": "net3",
        "text": "애니메이션은 framer-motion 라이브러리를 사용하였습니다.\n\n검색 아이콘을 클릭하면 설정해놓은 애니메이션이 실행됩니다.\n 검색 api는 영화와 티비쇼가 같이 검색되어 결과가 반환되기 때문에 영화 레이아웃과 티비 레이아웃을 나누었습니다. 콘테츠 리스트와 같이 같은 레이아웃을 쓰기때문에 하나의 컴포넌트에 리스트 컴포넌트와 디테일 컴포넌트를 넣어주었습니다. 리스트는  props에 type을 넣어주어 구분하였습니다.\n검색결과가 없을 경우 메시지를 띄어주어 사용자가 확인 할 수 있게 하였습니다. "
      },

      {
        "sub_title": "Loading Page",
        "image": "net4",
        "text": "데이터를 가져오는 동안 빈화면 대신 콘텐츠를 표시하는 용도로 react-loading-skeloton 라이브러리를 사용했습니다.\n스켈레톤 컴포넌트를 만들어 필요한 화면에 넣어주었습니다. "
      },
      {
        "sub_title": "Error Page",
        "image": "net5",
        "text": "에러가 날 경우 사용자들이 혼란스러워하지 않게 에러 컴포넌트를 만들어주었습니다. 새로고침을 유도하도록 문구를 적고 아래 버튼을 달아줬습니다. "
      }
    ],

    "thumbnail": "net1"
  },
  {
    "id": 2,
    "title": "Crypto Tracker * nextjs로 변경 중 *",
    "name": "CRYPTO",
    "technologies": [
      "React",
      "Typescript",
      "styled-component",
      "Recoil",
      "usequery"
    ],
    "description": "coinpaprika api를 활용한 암호화폐 트래커 페이지 만들기",
    "demo_link": "https://duckguya.github.io/crypto-tracker/",
    "github_link": "https://github.com/duckguya/crypto-tracker",
    "function": [
      "랭크순, 오름차순, 내림차순  정렬 기능 구현",
      "recoil을 이용한 다크 모드 구현",
      "outlet으로 중첩 랜더링을 한 디테일 페이지",
      "useInterval을 사용한 nav bar"
    ],
    "contents": [
      {
        "sub_title": "정렬 기능",
        "image": "coin1",
        "text": "랭크순, 오름차순, 내림차순으로 정렬 기능을 구현하였습니다.\n서버로부터 데이터를 조회하기 위해 useQuery를 사용하였습니다. useQuery의 두 번째 인자에 api 호출 함수를 넣어주었습니다.\n호출 함수의 props에 정렬 카테고리를 전달하여 데이터를 반환하기 전 sort() 함수를 사용할 수 있게 하였습니다.\n\napi를 호출하여 전달받은 데이터에는 coin 리스트와 token 리스트가 섞여있어 분리 처리를 하였습니다. filter 함수를 통해 데이터의 type이 token인 것과 coin인 것을 구분하여 반환하도록 처리하였습니다. "
      },
      {
        "sub_title": "다크 모드",
        "image": "coin2",
        "text": "Recoil을 사용하여 atom의 값에 따라 다크 모드와 라이트 모드가 변경되도록 구현하였습니다. atom의 기본값은 boolean 타입으로 지정해 주었습니다.\nThemeProvider를 다크 모드가 필요한 컴포넌트 위에 래핑 해주어 atom의 값이 변경되면 미리 설정해놓은 스타일 객체를 적용시켜 전역으로 theme의 스타일을 사용할 수 있게 하였습니다.\n\nuseRecoilState을 사용하여 다크 모드 버튼을 누르면 현재 값의 반대 값으로 변경시켜 값을 업데이트했습니다. 해당 atom을 구독하고 있던 ThemeProvider에 theme의 값이 변경되어 다크 모드와 라이트 모드를 사용할 수 있게 하였습니다. "
      },
      {
        "sub_title": "디테일 페이지",
        "image": "coin3",
        "text": "useParams 훅을 사용하여 url 파라미터에서 id 값을 가져왔습니다. 가져온 id를 api 호출 함수 props에 전달하여 해당 페이지의 디테일 데이터를 호출하여 렌더링 하였습니다.\n\nchart와 price 컴포넌트는 중첩 라우팅하여 표시해 주었습니다.\nreact router dom으로부터 improt 해온 Link 훅으로 서브 페이지를 추가한 후 Outlet 훅으로 부모 라우트의 컴포넌트에 자식 라우트 컴포넌트 위치를 지정해 주었습니다.\n\nchart는 react-apexcharts 라이브러리를 사용하여 커스텀 하였습니다.         "
      },
      {
        "sub_title": "nav bar",
        "image": "coin4",
        "text": "리스트 중 상위 5개의 암호화폐를 5초 주기로 교체하여 보여주었습니다.\n\nsetInterval 함수의 문제점을 보완한 커스텀 훅인 useInterval 함수를 사용하였습니다. 디테일 api를 호출해야 했기 때문에 coinId를 찾을 수 있는 리스트의 해당 인덱스가 필요했습니다.\nustState를 이용하여 index의 초깃값을 설정해 주고 5초마다 인덱스의 값이 1씩 증가하게 하였습니다.\nuseEffect의 두 번째 인자 값에 index를 넣어주어 index의 값이 변경되면 refetch 함수를 실행하여 react query가 refetch를 수행하도록 하였습니다. "
      }
    ],

    "thumbnail": "coin_thumbnail"
  }
]
